[{"post_date":"2022-12-10T02:15:04.000Z","job_id":"ThMe4SxxQu0AAAAAAAAAAA==","job_title":"Full Stack Developer, Senior Jobs","description":"Job Number: R0159559\n\nFull Stack Developer, Senior\nThe Challenge:\n\nAre you looking for an opportunity to build a powerhouse system that will modernize mission critical systems at a law enforcement agency and help protect against threats to the country? You know a good intelligence-driven visualization system is more than just a nice-looking interface and data. You use the right combination of clean code, APIs, analytics, and infrastructure to build a user-focused solution.\n\nWe need an experienced Full Stack Developer who will use their passion to guide a development team to learn new tools and te chn iques, identify and implement system improvements, and mentor teammates. This is an opportunity to help your client overcome their most difficult challenges using the latest architectural approaches like microservices, Cloud te chn ologies, and continuous delivery and tools like Docker, No SQL, DynamoDB, and Elasticsearch. By creating a custom investigative sof tware product, you'll directly impact an intelligence-driven and threat-focused organization by providing advance data discovery, analytics, exploitation, and visualization capabilities through application development and tool integration. With mentoring, positive code reviews, and opportunities to learn new tools and skills, we focus on growing as a team to make the best solutions for our clients. Join us as we build systems to change an intelligence-driven and threat-focused organization for the better.\n\nEmpower change with us.\n\nYou Have:\n• Experience with sof tware development\n• Experience with Java, Python, Bash scripting\n• Experience with Amazon Web Services (AWS)\n• Experience with No SQL databases\n• Experience with Elasticsearch\n• Knowledge of ETL\n• Secret clearance\n• Bachelor's degree\n\nClearance:\n\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information ; Secret clearance is required.\n\nBuild Your Career:\n\nA challenging and dynamic work environment isn't all we have to offer. When you join Booz Allen, you'll have access to:\n• experts in virtually every field\n• a culture that focuses on supporting our employees\n• opportunities that provide stability while offering variety\n\nYou'll also be exposed to a wealth of training resources through our Digital University, an online learning portal featuring more than 5000 functional and te chn ical courses, certifications, and books. Build your te chn ical skills through hands-on training on the latest tools and tech from our in-house experts. Pursuing certifications that directly impact your role? You may be able to take advantage of our tuition assistance, on-site boot camps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We'll help you develop the career you want as you chart your own course for success.\n\nWe're an equal employment opportunity/affirmative action employer that empowers our people to fearlessly drive change - no matter their race, color, ethnicity, religion, sex (including pregnancy, childbirth, lactation, or related medical conditions), national origin, ancestry, age, marital status, sexual orientation, gender identity and expression, disability, veteran status, military or uniformed service member status, genetic information, or any other status protected by applicable federal, state, local, or international law.\n\n#LI-AH1, DH1, DRE1, ID16","job_city":"Chantilly","employer":"Booz Allen Hamilton"},{"post_date":"2022-12-07T00:00:00.000Z","job_id":"Gn0m0Szq9UYAAAAAAAAAAA==","job_title":"Senior Software Engineer, Full Stack (Remote-Eligible)","description":"Clarendon Center (12089), United States of America, Arlington, Virginia\n\nSenior Software Engineer, Full Stack (Remote-Eligible)\n\nDo you love building and pioneering in the technology space? Do you enjoy solving complex business problems in a fast-paced, collaborative, inclusive, and iterative delivery environment? At Capital One, you'll be part of a big group of makers, breakers, doers and disruptors, who solve real problems and meet real customer needs. We are seeking Full Stack Software Engineers who are passionate about marrying data with emerging technologies. As a Capital One Software Engineer, you’ll have the opportunity to be on the forefront of driving a major transformation within Capital One.\n\nWhat You’ll Do:\n• Collaborate with and across Agile teams to design, develop, test, implement, and support technical solutions in full-stack development tools and technologies\n• Share your passion for staying on top of tech trends, experimenting with and learning new technologies, participating in internal & external technology communities, mentoring other members of the engineering community\n• Collaborate with digital product managers, and deliver robust cloud-based solutions that drive powerful experiences to help millions of Americans achieve financial empowerment\n• Utilize programming languages like JavaScript, Java, HTML/CSS, TypeScript, SQL, Python, and Go, Open Source RDBMS and NoSQL databases, Container Orchestration services including Docker and Kubernetes, and a variety of AWS tools and services\n\nCapital One is open to hiring a Remote Employee for this opportunity.\n\nBasic Qualifications:\n• Bachelor’s Degree\n• At least 4 years of experience in software engineering (Internship experience does not apply)\n\nPreferred Qualifications:\n• 5+ years of experience in at least one of the following: JavaScript, Java, TypeScript, SQL, Python, or Go\n• 1+ years of experience with AWS, GCP, Microsoft Azure, or another cloud service\n• 3+ years of experience in open source frameworks\n• 2+ years of experience in Agile practices\n\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position.\n\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\n\nLocation is New York City\n\n- $156,596 and $184,748 for Senior Software Engineer\n\nLocation is Colorado\n\n- $132,699 and $156,555 for Senior Software Engineer\n\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\n\nNo agencies please. Capital One is an Equal Opportunity Employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex, race, color, age, national origin, religion, physical and mental disability, genetic information, marital status, sexual orientation, gender identity/assignment, citizenship, pregnancy or maternity, protected veteran status, or any other status prohibited by applicable national, federal, state or local law. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\n\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).","job_city":"Arlington","employer":"Capital One - US"},{"post_date":"2022-10-12T00:00:00.000Z","job_id":"dSxQ7Nf-PRYAAAAAAAAAAA==","job_title":"O02 Full Stack Developer","description":"Start Date: Immediate\n\nAt TalentWerx, we are focused on partnering with America’s top companies to acquire new talent with speed, accuracy, and a differentiated pricing model. We pride ourselves in acquiring top talent to ensure our clients' competitive advantage.\n\nOur client is a technology solutions company specializing in high-end security solutions for large-scale enterprises. They are certified in a broad spectrum of capabilities that better serve their diverse clientele, including federal government entities and private businesses.\n\nOVERVIEW\n\nFull-time/Permanent Employee\n\nLocation: Chantilly, VA\n\nOur client is looking a Full Stack Engineer to assist with the software maintenance, integration, deployment, and sustainment of maritime systems.\n\nThis role is responsible for adaptive and perfective maintenance of maritime systems software. This role uses best practices and patterns to perform design, development, and automated testing of software modules via DevSecOps in an Agile team.\n\nRESPONSIBILITIES\n• This role performs software systems development, including the design, development, troubleshooting, and debugging of software programs for software enhancements and maintenance.\n• Participate in peer reviews and unit testing and must be adaptable to different responsibilities.\n• Duties include software requirements analysis and development of software products in a maintenance setting.\n• This role is responsible for identifying software and hardware dependencies and capacities.\n• Creating and maintaining documentation is part of this role.\n\nKEY QUALIFICATIONS\n• Clearance: TS/SCI\n• Education/ Years of Experience: Requires a BS in Information Systems, Information Technology, Computer Science or closely related discipline and 4+ years of prior relevant experience or Masters with 2+ years of prior relevant experience; OR 4 years of experience in lieu of degree\n• Proficient in software development projects or software integration projects in a service-oriented environment (Cloud, SOA, Web-Services) or virtualization environment.\n• Proficient in AWS/Cloud technologies\n• Experience with cloud-based architectures\n• Understanding of DevOps methodologies and workflow\n• Knowledge of the Architectural, SW Development and SW Sustainment Practices\n• Familiar with Java, NodeJS, PostgreSQL\n• Familiar with build tools, such as Maven\n• Familiar with Git/GitLab or other source code control tools\n• Familiar with Amazon Web Services (S3 Buckets, EC2, Reserved Instances, etc.)\n• Familiar with System Engineering documentation creation (VDDs, diagrams, etc.)\n• Familiar with team collaboration tools (Jira, Confluence, RocketChat)\n\nADDITIONAL QUALIFICATIONS\n• Familiar with some sort of deployment platform such as Jenkins, GitLab CI/CD, or other proprietary deployment platforms.\n• Familiar with Apache NiFi\n\nTalentWerx is an Equal Opportunity Employer – Females/Minorities/Protected Veterans/Individuals with Disabilities","job_city":"Chantilly","employer":"TalentWerx"},{"post_date":"2022-12-08T17:58:48.000Z","job_id":"i4XTS7IRFrEAAAAAAAAAAA==","job_title":"Full Stack Engineer","description":"Required Skills\n\nMinimum 7 years demonstrated experience with software development.\n\nStrong and evolving competence in several programming languages and technologies, working knowledge of multiple tool sets, technologies and implementation environments\n\nStrong practical experience in Python, Node (NPM acceptable) and JavaScript and scripting experience in a Cloud based environment\n\nExposure to AWS technologies\n\nPossess technical skills and experience in the virtual infrastructure domain, specifically Amazon Web Services.\n\nDesign and development experience in building and monitoring microservices\n\nWorking experience on CI/CD using Jenkins /AWS Code pipeline\n\nDemonstrated experience in developing full stack solutions using NodeJS\n\nFundamentals in OO and computer science foundation principles.\n\nWorking knowledge of distributed architectural design patterns\n\nKnowledge of systems analysis and design (including OOAD and UML), and database design\n\nKnowledge of software development lifecycle and modern software engineering principles and practices\n\nExperience setting up a DataOps\n\nPreferred Skills\n\nHigh analytical skills and knack to develop tools for monitoring high frequency data services.\n\nExperience working on Agile teams with the scrum team member attitude willingness to support the Team to be successful in any area necessary\n\nDemonstrated experience with AWS cloud supported programming languages like JavaScript, React JS, and Python development.\n\nExperience building infrastructure as code using AWS CloudFormation or similar scripting techniques\n\nAppetite to Learn new things\n\nSome knowledge in data science and/or machine learning Benefits\n\nEducation/Certifications\n\nBachelor s degree and/or other advanced degree(s)\n\nRelevant AWS or other professional certifications","job_city":"Reston","employer":"Ampcus Inc"},{"post_date":"2022-12-09T00:00:00.000Z","job_id":"yQ2jMwV087kAAAAAAAAAAA==","job_title":"Full Stack Developer with Security Clearance","description":"Alpha Omega Integration, LLC., a Virginia Business Best Places to work for 2012-2020, along with recognition such as the Virginia Chamber of Commerce Fantastic 50, Inc. 5000 #143, Washington Technology Fast 50 #11, and the Vanguard Top Service Company Award is actively seeking passionate leaders to join our team, support our nation's government agencies, and make a difference! Why Us? We foster a culture that values hard work and integrity. We are constantly awarding those who are self-starters, trustworthy and have a good work ethic. If you like working with the latest in IT solutions and are looking to join an organization that is consistently voted one of the best in which to work, then check out your next career opportunity below! We are actively seeking team members who enjoy meeting challenges with a smile. We offer a fast-paced, growing environment that takes care of the overall development of our employees. Alpha Omega has an exciting opportunity for you to be part of a team where you'll have the opportunity to make a difference. Job Title: Full Stack Developer Work Location: Remote Clearance Required: DHS Public Trust, US Citizen As a full stack developer, you will be problem solving using complete end-to-end solutions in a fast-paced, agile environment. We are looking for developers that like to wear many hats and work with a dynamic suite of technologies to build software from vision to production. We are looking for a Full Stack Developer to join our team in the modernization of several applications utilized by a Federal Government client. This team is using technologies such as React, Ruby, JavaScript, Java, Python, Typescript, AWS and more! Responsibilities: * Design, develop, test, deploy, maintain, and improve several software applications.\n• Build and own full stack development for software applications\n• Develop new features using acceptance test-driven development\n• Participate in pair programming methodologies\n• Build and own quality throughout the development cycle by writing automated unit tests, integration tests, functional tests, and UI tests\n• Work in and with small feature delivery teams: cross-functional, cross-component team that completes many end-to-end customer features, one by one\n• Develop and maintain API specifications using Swagger Editor\n• Develop new features using microservices\n• Develop API design approach using AWS cloud and open source technologies\n• Participate in Extreme Programming methodologies\n• Participate in product strategy, product design and product development activities\n• Use lean and agile work management and engineering practices\n\nRequired Skills/Experience: * 2-4 years of relevant professional experience.\n• Proven full stack application development experience including front end technologies such as HTML/CSS/JS, React, and backend technologies such as Ruby, Java, Python, and database technologies such as Oracle and PostgreSQL. * Excellent communication skills, written and oral\n• Strong team building and collaboration skills\n• 1+ years' experience with Ruby on Rails * Strong experience with JavaScript.\n• Experience with Git based source code repositories such as Github, Gitlab, Bitbucket.\n• Agile development experience\n• Intellectual curiosity\n• Ability to learn new technologies quickly and wear many hats\n\nPreferred Skills/Experience: * Experience using Java spring boot\n• Experience using Python and Django\n• Experience using AWS cloud services.\n• Experience using Cloud Foundry\n• Experience with React\n\nAlpha Omega Integration, LLC (Alpha Omega) is committed to the development of a creative, diverse and inclusive work environment. In order to provide equal employment and advancement opportunities to all individuals, employment decisions at Alpha Omega will be based on merit, qualifications, and abilities. Alpha Omega does not discriminate against any person because of race, color, creed, religion, sex, sexual orientation, gender identity, national origin, disability, age, IWDs, Veteran Status or any other characteristic protected by law (referred to as \"protected status).\"","job_city":"Vienna","employer":"ClearanceJobs"},{"post_date":"2022-12-02T00:00:00.000Z","job_id":"BDpCPHIy9rYAAAAAAAAAAA==","job_title":"Senior Full Stack Developer","description":"Armedia is a CMMI-DEV Level 3 appraised and ISO 9001:2015 certified systems integrator providing Business Process, Document, Enterprise Content, Electronic Case, and Records Management services and solutions to many federal agencies and corporations, ranging from startups to Fortune 500 companies.\n\nArmedia has been ranked on the Inc. 5000 list of America's fastest growing companies and we have been recognized as one of the 'Best and Brightest Companies to Work' for by the National Association for Business Resources. We value and promote diversity and we pride ourselves on fostering a culture inclusive of all identities.\n\nThe role of a Full Stack Software Developer involves working as part of a team on the design and implementation of Java or .NET based solutions using traditional SDLC, Agile, and or SCRUM software development methodologies. While working as part of a team, you will work with Business Analysts, Project Managers, Senior Architects, Senior and Junior Java Developers.\n\nYour responsibilities include:\n• Support design and development of both scalable front and back-end technologies with proven experience in the design and implementation of highly responsive web applications.\n• Determine the overall LOE for the project tasks to which you are assigned, and provide key input to the projected delivery schedule. You will review estimates proposed by Senior and Junior Developers and revise them as needed.\n• Ensure the overall quality and fit of the technical solution in addition to the overall performance of the application stack for projects to which you are assigned. You will work with other Senior Developers and Developers to iterate on the quality and fit of the technical solution.\n• Proactively create application architecture reference material and standards for internal use to help with the design and development of solutions.\n• Contribute for the process improvements related to solution design and development as it pertains to build and test automation, release management, and coding best practices that cover quality and consistency.\n\nYou are expected to have deep knowledge and experience in the following areas, depending on your area of expertise:\n\nBackend\n• Java frameworks including JEE, Spring, Struts and persistence frameworks including Hibernate and MyBatis\n• Java Application Servers including Tomcat, WebSphere, WebLogic, and or Glassfish\n• JDK Editions and versions including Oracle/Sun, IBM, and OpenJDK\n• .NET framework and experience with other Microsoft Technologies, including IIS\n• Other support languages: Python, Perl, PHP\n• SQL development against Oracle, MS SQL Server, MySQL/MariaDB, DB2, PostgreSQL, AWS RDS\n• JUnit, JMeter/JActor, Selenium, HP QualityCenter, and or other automated testing tools\n• Web Services, Public Key Infrastructure (PKI), Application Security, Application Scaling and Clustering, and Performance Analysis and Tuning\n\nFrontend\n• XML, XSL, HTML, CSS, JavaScript, Java, SQL, JSON, AJAX, WSDL, XML/RPC, SOAP, JMX\n• Angular, AngularJS, jQuery, Node.js, React or other Java scripting tool\n• ASP.NET, C#\n• Eclipse/STS, NetBeans, IntelliJ, or other popular Integrated Development Environments (IDEs)\n• Experience in developing and deploying on cloud based infrastructures, specifically AWS and Azure. Other cloud infrastructure experience may be acceptable\n\nRequired Education\n\nBachelor's degree in Computer Science, Information Systems Management, Mathematics, Statistics, Engineering or related field\n\nRequired Professional Certifications\n\nNone\n\nDesired Professional Certifications\n\nSecurity +\n\nAWS related certifications\n\nSpecific Development Technology\n\nRequired Years of Relevant Experience\n\n5-10 years of hands-on experience developing both front and back end solutions\n\nDesired Years of Relevant Experience\n\n5-10 years of hands-on experience developing in an team environment using Agile methodologies\n\nRequired Skills\n• Full understanding of cloud technologies to support web based solutions\n• Full understanding of backend technology stack and languages and their role in supporting highly responsive web applications (Java/C#, CSS, HTML, XML, JSON, Python, Perl …)\n• Experience in writing Javascript, Angular, React or other Java Scripting technology\n• Other Web development technologies – CSS, PHP …\n\nDesired Skills\n• Deploying and working in the Cloud (AWS, Azure)\n• GIT, CodeCommit, BitBucket, Azure DevOps or other code management framework to support Agile Scrum development\n• Test Driven Development and Test Automation\n\nPosition Duties and Responsibilities\n• Creating solution Proofs Of Concept (POCs) as needed to confirm solution viability and or demonstrate high-level solution functionality\n• Conceptualization of potential solutions - coupled with the ability to articulate through use of whiteboards and presentations during working sessions, this creates a strong impression with business representatives and internal delivery teams. Business users and IT representatives often quickly and preferably in real time want solution outlines so that they can visualize it and quickly settle on an approach\n• Team Leadership - comprises the ability to effectively provide technical direction to client representatives and assigned project delivery team(s), in addition to mentoring and providing development direction to project development track leads and developers\n\nAdditional Requirements\n\nAuthorization to work in the US\n\nSpeaks clearly with confidence\n\nExcellent written communication\n\nArmedia offers competitive compensation and a comprehensive benefits package, including subsidized medical, dental, and vision insurance, life insurance, discounted disability insurance, a 401k retirement plan with company match, generous PTO, and paid holidays.\n\nArmedia is an Equal Opportunity Employer dedicated to hiring and retaining a diverse workforce. We will not discriminate against any applicant or employee for employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex/gender identity, sexual orientation, national origin, age, veteran status, disability, or any other protected class. We celebrate diversity and are committed to creating an inclusive environment for all employees.","job_city":"Vienna","employer":"Armedia, LLC"},{"post_date":"2022-12-08T00:00:00.000Z","job_id":"FHgkYLZuABwAAAAAAAAAAA==","job_title":"Full Stack Developer - Mid Level","description":"Description\n\nUniversal Consulting Services, UCS, is seeking a mid-level Full Stack Developer for a Agile Development Project supporting an Acquisition Workload and Data Application. The person in this role engages in both front-end development and database development. The Full Stack Developer would have demonstrated experience developing, implementing, and maintaining software applications, designing, developing, coding, and unit testing of software changes.\n\nThis opportunity is 100% remote. Candidates living in Virginia, Maryland or DC are preferred.\n\nUS Citizen with the ability to obtain a Public Trust required.\n\nThe Full Stack Developer must have experience with Microsoft .NET Core.\n\nPrevious experience with the following Tools and Technologies required:\n• Microsoft .NET Core 2.2\n• MS SQL 2016 and experience writing MS SQL script code\n• Entity Framework Core\n• Vue2 and Webpack\n• Knowledge of all of these technologies will be very important but especially knowledge of .NET Core and MS SQL 2016.\n\nRequirements\n\nPrevious experience with the following tools and technologies required:\n• 4 years of experience as a Full Stack Developer supporting both front end and database development\n• This role requires experience with newer technologies such as Vue.js and Webpack (or Angular)\n• Previous experience with using .NET Core is required\n• Previous experience developing in the Agile Sprint environment\n• Four year technical degree from accredited university or college","job_city":"Fairfax","employer":"Universal Consulting Services"},{"post_date":"2022-12-05T02:16:26.000Z","job_id":"wzE-N_X0JkIAAAAAAAAAAA==","job_title":"Full Stack Developer Jobs","description":"Secure our Nation, Ignite your Future\n\nBecome an integral part of a diverse team while working at an Industry Leading Organization, where our employees come first. At ManTech International Corporation, you'll help protect our national security while working on innovative projects that offer opportunities for advancement.\n\nCurrently, ManTech-Intel Sector has a unique opportunity for a motivated, career and customer-oriented Full Stack Developer to join our team in the Columbia, MD area. You will get a chance to work with some of the most sophisticated tools and technologies while enhancing your career in a state of the art development environment.\n\nRequired Experience:\n• Professional level experience with Java\n• Experience using a major JavaScript framework such as React\n• Ability to analyze and troubleshoot software application components\n• Ability to unit test and analyze software\n• Knowledge of the software development life-cycle\n\nDesired Experience:\n• Experience developing with Golang\n• Docker\n• Git and software versioning experience\n• Ability to work in a fast-paced, Scrum environment\n\nResponsibilities include, but are not limited to:\n• Responsible for developing applications software for small to highly complex computer systems or portions of large integrated systems and/or for providing analysis and engineering of functional aspects of software and hardware architecture and system support.\n• The candidate will prepare detailed specifications from which software products will be designed and/or candidate will translate documented designs into software products by developing, documenting, testing and debugging code.\n• Experience with applications that deal with utility programs, job control language, macro, subroutines and other control modules.\n\nBasic Qualifications:\n• Must have a High School Diploma\n• Shall have a minimum of thirteen (13) years' experience in software engineering/development and/or systems engineering/analysis\n• Must possess experience in all phases of software engineering to include requirements analysis, development, testing and integration, maintenance and problem diagnosis/resolution and/or experience in phases of applications systems analysis to include evaluation and design, integration and optimization of complex systems\n• Must have experience with communication applications, database management, use of programming languages and knowledge of storage and retrieval methods\n\nPreferred Qualifications:\n• A Bachelor's degree in engineering, computer science, mathematics, or related discipline may be substituted for three (3) years of work experience.\n• A Master's degree in any of the above disciplines may be substituted for an additional two (2) years of experience.\n• Candidate shall be competent to work at the highest level of all phases of software engineering and/or all phases of applications systems analysis with minimal direction or oversight.\n\nSecurity Clearance Requirements:\n• Active/Current Top-Secret SCI with Poly\n\nFor all positions requiring access to technology/software source code that is subject to export control laws, employment with the company is contingent on either verifying U.S.-person status or obtaining any necessary license.The applicant will be required to answer certain questions for export control purposes, and that information will be reviewed by compliance personnel to ensure compliance with federal law. ManTech may choose not to apply for a license for such individuals whose access to export-controlled technology or software source code may require authorization and may decline to proceed with an applicant on that basis alone.\n\nManTech International Corporation, as well as its subsidiaries proactively fulfills its role as an equal opportunity employer. We do not discriminate against any employee or applicant for employment because of race, color, sex, religion, age, sexual orientation, gender identity and expression, national origin, marital status, physical or mental disability, status as a Disabled Veteran, Recently Separated Veteran, Active Duty Wartime or Campaign Badge Veteran, Armed Forces Services Medal, or any other characteristic protected by law.\n\nIf you require a reasonable accommodation to apply for a position with ManTech through its online applicant system, please contact ManTech's Corporate EEO Department at (703) 218-6000. ManTech is an affirmative action/equal opportunity employer - minorities, females, disabled and protected veterans are urged to apply. ManTech's utilization of any external recruitment or job placement agency is predicated upon its full compliance with our equal opportunity/affirmative action policies. ManTech does not accept resumes from unsolicited recruiting firms. We pay no fees for unsolicited services.\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access http://www.mantech.com/careers/Pages/careers.aspx as a result of your disability. To request an accommodation please click careers@mantech.com and provide your name and contact information.","job_city":"Columbia","employer":"ManTech International"},{"post_date":"2022-10-27T19:18:19.000Z","job_id":"iON-oLopwmcAAAAAAAAAAA==","job_title":"Senior Full Stack Developer","description":"Company Description\n\nMyth Software, an SBA-certified woman-owned 8(a), specializes in software development, data management, and enterprise architecture. Based in the Washington, DC area, the talent at Myth Software have been successfully delivering innovative information technology solutions to the public and private sector for over 20 years.\n\nJob Description\n\nThe Homeland Security Solutions Operation s is seeking a Full Stack Developer with strong systems, software, cloud, and Agile experience to support a complex program to provide Agile development and operations and maintenance for critical systems on a mission-critical program supporting the Passenger Systems Program Directorate (PSPD) within Customs and Border Protection (CBP). PSPD supports the Department of Homeland Security (DHS) and CBP critical missions, specifically screening and processing travelers at the ports of entry (POEs) into the United States.\n\nIn this hands-on position, you will work collaboratively to architect, design, build, deliver, and enhance highly available, scalable, real-time systems. You will exercise your judgment in determining and recommending the best designs based on customer business objectives, timelines, and other resource constraints. You will participate in and/or direct major deliverable of projects through all aspects of the software development life cycle including scope and work estimation, architecture and design, coding, and unit testing.\n\nQualifications\n\nBasic Qualifications:\n• BS/BA degree and 8 years of experience or Master’s with 6 years of experience; OR 4 years of experience in lieu of degree\n• Must be able to maintain and obtain a CBP Background Investigation prior to start\n• 2+ years of experience in one of the following: JAVA, JSF, JavaScript, Spring\n• Minimum 2 years of experience in at least 2 of the following: React, Angular, Redux, HTML, CSS, JSX, bootstrap, ES6, Redux, JWT, JSON, Babel, Webpack, Axios, NPM, Node.\n• Proficient in JAVA, JavaScript, including DOM manipulation and the JavaScript object model\n• Thorough understanding of React and Angular and its core principles\n• Hands on experience with RESTful APIs\n• Expertise with Axios framework to work with rest services.\n• Hands on experience with HTML/CSS/Bootstrap\n• Hands on experience of modern authorization mechanisms, such as JSON Web Token (JWT)\n\nPreferred Qualifications:\n• Hands on working experience with Redux Store for session management.\n• Hands on experience with more current specifications of EcmaScript (ES6)\n• Experience with common front-end development tools such as Babel, Webpack, NPM, Node etc.\n• A knack for benchmarking and optimization is plus.\n\nAdditional Information\n\nNo third party applicants. U.S. Citizens only.","job_city":"Fairfax","employer":"Myth Software"},{"post_date":"2022-04-07T00:00:00.000Z","job_id":"z4KLtCzYXckAAAAAAAAAAA==","job_title":"Senior Full Stack Engineer","description":"About minware\n\nminware’s aims to eliminate waste from software engineering by helping engineers write less bad code. We do that by analyzing what happens to code after it is written to help people improve the way they work.\n\nKevin Borders founded minware after bootstrapping his previous company to $86m in revenue and selling in 2021, with the idea of helping others benefit from lessons learned growing an engineering team from 0 to 40.\n\nminware is a self-funded seed-stage company. After promising initial customer traction, we are looking for people who share our values to help bring minware to a larger audience.\n\nThe Role\n\nAs an early engineer, you will have the unique opportunity to work directly with minware’s founders to build the product from the ground up. We are looking for someone who enjoys operating in the full stack and learning new things, with an emphasis on using React, GraphQL, and Next.js to build the main analytics application.\n\nWe are seeking an ambitious and nice senior engineer who has experience independently executing complex projects and building scalable, maintainable software. As a purveyor of developer productivity analytics, we are diligent about process efficiency and code quality. Though we are small, we try to avoid unnecessarily creating technical debt and are looking for someone who can lead us toward this goal.\n\nPrimary Responsibilities\n• Independently plan, implement, and test features in the minware application\n• Work closely with product managers and customers to define minware’s capabilities\n• Design and architect new system components\n• Manage a backlog of tech debt reduction and internal efficiency improvements\n• (Optional) Conduct interviews and help with hiring other engineers\n\nQualifications\n• Experience building and maintaining a complex full-stack application\n• Familiarity with principles of high-quality code, including continuous integration, declarative and functional programming\n• Strong communication skills for interfacing with non-technical stakeholders and occasionally with customers\n• Well-versed in agile or lean planning and project management processes\n• Experience with the core stack (Postgres, Next.js, Apollo GraphQL, React) or similar technologies is preferred\n• Proficiency with infrastructure (AWS, Terraform) and UI (HTML, CSS, Figma) is optional, but nice to have\n\nBenefits and Perks\n• Competitive base salary, bonus, and seed-stage equity compensation\n• 100% remote work, flexible hours, and unlimited vacation policy. (Read here about how we built trust in our previous all-remote company.)\n• Full health care premium coverage for you and your family\n• Unique career development guidance reporting directly to the founder/CEO","job_city":"Washington","employer":"minware"}]